# Importações

In [ ]:
import pandas as pd
import sqlite3

# Exercício 1

Crie uma tabela chamada "alunos" com os seguintes campos: id
(inteiro), nome (texto), idade (inteiro) e curso (texto).

In [ ]:
# criação da tabela alunos

alunos = sqlite3.connect('banco_alunos.db')

In [ ]:
# criação de cursor para executar os comandos SQL

cursor = alunos.cursor()

In [ ]:
# criação dos campos da tabela

cursor.execute('CREATE TABLE alunos(Id INT, Nome VARCHAR, Idade INT, Curso VARCHAR)')

In [ ]:
# salvar as alterações feitas na tabela

alunos.commit()

In [ ]:
# PRINTANDO A TABELA

# consulta SQL
query = "SELECT * FROM alunos"

# carregar os resultados no pandas
df = pd.read_sql_query(query, alunos)

# exibir a tabela no Colab
df

# printando os resultados
print(df)

Empty DataFrame
Columns: [Id, Nome, Idade, Curso]
Index: []

# Exercício 2

Insira pelo menos 5 registros de alunos na tabela que você criou no
exercício anterior.

In [ ]:
# inclusão de 10 registros de alunas na tabela

cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES(1, "Bianca", 27, "Análise de Dados")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES(2, "Ana", 33, "Programação em Java")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES(3, "Esther", 24, "Desenvolvimento de Software")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES(4, "Larissa", 43, "Ciência da Computação")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES(5, "Clara", 21, "Desenvolvimento de Sistemas")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES(6, "Bruna", 38, "Engenharia da Computação")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES(7, "Luana", 29, "Engenharia de Programação")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES(8, "Zara", 25, "Engenharia de Sistemas")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES(9, "Seleste", 18, "Engenharia de Dados")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES(10, "Mara", 19, "Engenharia de Software")')

In [ ]:
# salvar as alterações feitas na tabela

alunos.commit()

In [ ]:
# PRINTANDO A TABELA

# consulta SQL
query = "SELECT * FROM alunos"

# carregar os resultados no pandas
df = pd.read_sql_query(query, alunos)

# exibir a tabela no Colab
df

# printando os resultados
print(df)

   Id     Nome  Idade                        Curso
0   1   Bianca     27             Análise de Dados
1   2      Ana     33          Programação em Java
2   3   Esther     24  Desenvolvimento de Software
3   4  Larissa     43        Ciência da Computação
4   5    Clara     21  Desenvolvimento de Sistemas
5   6    Bruna     38     Engenharia da Computação
6   7    Luana     29    Engenharia de Programação
7   8     Zara     25       Engenharia de Sistemas
8   9  Seleste     18          Engenharia de Dados
9  10     Mara     19       Engenharia de Software

# Exercício 3

**Consultas Básicas** <br>
Escreva consultas SQL para realizar as seguintes tarefas:

a) Selecionar todos os registros da tabela "alunos".

In [ ]:
dados_total = cursor.execute('SELECT * FROM alunos')

for alunos in dados_total:
  print(alunos)

(1, 'Bianca', 27, 'Análise de Dados')
(2, 'Ana', 33, 'Programação em Java')
(3, 'Esther', 24, 'Desenvolvimento de Software')
(4, 'Larissa', 43, 'Ciência da Computação')
(5, 'Clara', 21, 'Desenvolvimento de Sistemas')
(6, 'Bruna', 38, 'Engenharia da Computação')
(7, 'Luana', 29, 'Engenharia de Programação')
(8, 'Zara', 25, 'Engenharia de Sistemas')
(9, 'Seleste', 18, 'Engenharia de Dados')
(10, 'Mara', 19, 'Engenharia de Software')

b) Selecionar o nome e a idade dos alunos com mais de 20 anos.

In [ ]:
dados_idade = cursor.execute('SELECT nome, idade FROM alunos WHERE idade > 20')

for alunos in dados_idade:
  print(alunos)

('Bianca', 27)
('Ana', 33)
('Esther', 24)
('Larissa', 43)
('Clara', 21)
('Bruna', 38)
('Luana', 29)
('Zara', 25)

c) Selecionar os alunos do curso de "Engenharia" em ordem
alfabética.

In [ ]:
engenharia_ordem = cursor.execute('SELECT * FROM alunos WHERE Curso LIKE "Engenharia%" ORDER BY nome')

for alunos in engenharia_ordem:
  print(alunos)

(6, 'Bruna', 38, 'Engenharia da Computação')
(7, 'Luana', 29, 'Engenharia de Programação')
(10, 'Mara', 19, 'Engenharia de Software')
(9, 'Seleste', 18, 'Engenharia de Dados')
(8, 'Zara', 25, 'Engenharia de Sistemas')

d) Contar o número total de alunos na tabela

In [ ]:
# contagem de quantos alunos tem na tabela - gera um código
resultado = cursor.execute("SELECT COUNT(*) FROM alunos")

# "tradução" do código para a linguagem "humana"
total_alunos = resultado.fetchone()[0]

print('O total de alunos na tabela é: ' + str(total_alunos))

O total de alunos na tabela é: 10

# Exercício 4

**Atualização e Remoção**

a) Atualize a idade de um aluno específico na tabela.

In [ ]:
# fazendo update de idade de aluno específico e definindo variável para essa ação
# isso é uma tupla, então não dá para printar direto (é necessário criar outra variável para isso), nem fazer commit

update_idade = cursor.execute('UPDATE alunos SET idade = 26 WHERE nome = "Zara"')

# atualizando tabela para viabilizar o print
tabela_atualizada = cursor.execute("SELECT * FROM alunos")

# print da tabela considerando essas alterações
for alunos in tabela_atualizada:
  print(alunos)

(1, 'Bianca', 27, 'Análise de Dados')
(2, 'Ana', 33, 'Programação em Java')
(3, 'Esther', 24, 'Desenvolvimento de Software')
(4, 'Larissa', 43, 'Ciência da Computação')
(5, 'Clara', 21, 'Desenvolvimento de Sistemas')
(6, 'Bruna', 38, 'Engenharia da Computação')
(7, 'Luana', 29, 'Engenharia de Programação')
(8, 'Zara', 26, 'Engenharia de Sistemas')
(9, 'Seleste', 18, 'Engenharia de Dados')
(10, 'Mara', 19, 'Engenharia de Software')

b) Remova um aluno pelo seu ID.

In [ ]:
# deletando aluno por seu ID e definindo variável para essa ação
# isso é uma tupla, então não dá para printar direto (é necessário criar outra variável para isso), nem fazer commit
delete_id = cursor.execute('DELETE FROM alunos WHERE id = 2')

# atualizando tabela para viabilizar o print
tabela_exclusao = cursor.execute("SELECT * FROM alunos")

# print da tabela considerando essas alterações
for alunos in tabela_exclusao:
  print(alunos)

(1, 'Bianca', 27, 'Análise de Dados')
(3, 'Esther', 24, 'Desenvolvimento de Software')
(4, 'Larissa', 43, 'Ciência da Computação')
(5, 'Clara', 21, 'Desenvolvimento de Sistemas')
(6, 'Bruna', 38, 'Engenharia da Computação')
(7, 'Luana', 29, 'Engenharia de Programação')
(8, 'Zara', 26, 'Engenharia de Sistemas')
(9, 'Seleste', 18, 'Engenharia de Dados')
(10, 'Mara', 19, 'Engenharia de Software')

# Exercício 5

Criar uma Tabela e Inserir Dados

Crie uma tabela chamada "clientes" com os campos: id (chave
primária), nome (texto), idade (inteiro) e saldo (float). Insira alguns
registros de clientes na tabela.

In [ ]:
# criação da tabela clientes

clientes = sqlite3.connect('banco_geral')

In [ ]:
# criação de cursor para executar os comandos SQL

cursor = clientes.cursor()

In [ ]:
# criação dos campos da tabela

cursor.execute('CREATE TABLE clientes(id INTEGER PRIMARY KEY, Nome VARCHAR, Idade INT, Saldo FLOAT)')

In [ ]:
# inclusão de 10 registros de alunas na tabela

cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES(1, "Bianca", 27, 234)')
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES(2, "Ana", 33, 4827)')
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES(3, "Esther", 24, 847)')
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES(4, "Larissa", 43, 98)')
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES(5, "Clara", 21, 412)')
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES(6, "Bruna", 38, 4128)')
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES(7, "Luana", 29, 4391)')
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES(8, "Zara", 25, 431)')
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES(9, "Seleste", 18, 421)')
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES(10, "Mara", 19, 4129836)')

In [ ]:
# salvar as alterações feitas na tabela

clientes.commit()

In [ ]:
# PRINTANDO A TABELA

# consulta SQL
query = "SELECT * FROM clientes"

# carregar os resultados no pandas
df = pd.read_sql_query(query, clientes)

# exibir a tabela no Colab
df

# printando os resultados
print(df)

   id     Nome  Idade      Saldo
0   1   Bianca     27      234.0
1   2      Ana     33     4827.0
2   3   Esther     24      847.0
3   4  Larissa     43       98.0
4   5    Clara     21      412.0
5   6    Bruna     38     4128.0
6   7    Luana     29     4391.0
7   8     Zara     25      431.0
8   9  Seleste     18      421.0
9  10     Mara     19  4129836.0

In [ ]:
conexao = sqlite3.connect('banco_geral')
query = "SELECT name FROM sqlite_master WHERE type='table';"
df = pd.read_sql_query(query, conexao)

print(df)

       name
0  clientes

# Exercício 6

**Consultas e Funções Agregadas** </br>
Escreva consultas SQL para realizar as seguintes tarefas:

a) Selecione o nome e a idade dos clientes com idade superior a
30 anos.

In [ ]:
# Seleção do nome e idade dos clientes com idade superior a 30 anos
dados_nome_idade = cursor.execute('SELECT nome, idade FROM clientes WHERE idade > 30')

# Print dos Resultados
for clientes in dados_nome_idade:
  print(clientes)

('Ana', 33)
('Larissa', 43)
('Bruna', 38)

b) Calcule o saldo médio dos clientes.

In [ ]:
# Calculo da média da coluna clientes
saldo_medio = cursor.execute('SELECT AVG(saldo) FROM clientes')

for clientes in saldo_medio:
  print(clientes)

(414562.5,)

**c**) Encontre o cliente com o saldo máximo.

In [ ]:
saldo_medio = cursor.execute('SELECT id, nome, idade, MAX(saldo) FROM clientes')

for clientes in saldo_medio:
  print(clientes)

(10, 'Mara', 19, 4129836.0)

d) Conte quantos clientes têm saldo acima de 1000.

In [ ]:
# Conta de quantos clientes têm saldo acima de 100 (dado que precisa ser processado)

saldo_maior = cursor.execute('SELECT COUNT(*) FROM clientes WHERE saldo > 1000')

# Pega o primeiro valor retornado pela consulta (o número total de clientes)
total_clientes = saldo_maior.fetchone()[0]

# Print do resultado
print('Clientes que têm saldo acima de 1000: ' + str(total_clientes))

Clientes que têm saldo acima de 1000: 4

# Exercício 7

**Atualização e Remoção com Condições**

a) Atualize o saldo de um cliente específico.

In [ ]:
# Atualização do Saldo da cliente Mara / Id 10
atualizacao = cursor.execute('UPDATE clientes SET saldo = 1673 WHERE id = 10')

# Seleção da tabela inteira
tabela_nova = cursor.execute('SELECT * FROM clientes')

# Print da tabela com atualização
for clientes in tabela_nova:
  print(clientes)

(1, 'Bianca', 27, 234.0)
(2, 'Ana', 33, 4827.0)
(3, 'Esther', 24, 847.0)
(4, 'Larissa', 43, 98.0)
(5, 'Clara', 21, 412.0)
(6, 'Bruna', 38, 4128.0)
(7, 'Luana', 29, 4391.0)
(8, 'Zara', 25, 431.0)
(9, 'Seleste', 18, 421.0)
(10, 'Mara', 19, 1673.0)

b) Remova um cliente pelo seu ID.

In [ ]:
# Remoção da cliente Mara em função de seu ID (10)
remocao = cursor.execute('DELETE FROM clientes WHERE Id = 10')

# Seleção da Tabela Inteira
tabela_remocao = cursor.execute('SELECT * FROM clientes')

# Print da Tabela com Remoção
for clientes in tabela_remocao:
  print(clientes)

(1, 'Bianca', 27, 234.0)
(2, 'Ana', 33, 4827.0)
(3, 'Esther', 24, 847.0)
(4, 'Larissa', 43, 98.0)
(5, 'Clara', 21, 412.0)
(6, 'Bruna', 38, 4128.0)
(7, 'Luana', 29, 4391.0)
(8, 'Zara', 25, 431.0)
(9, 'Seleste', 18, 421.0)

In [ ]:
conexao = sqlite3.connect('banco_geral')

conexao.close()

# Exercício 8

**Junção de Tabelas**

Crie uma segunda tabela chamada "compras" com os campos: id
(chave primária), cliente_id (chave estrangeira referenciando o id
da tabela "clientes"), produto (texto) e valor (real).

In [ ]:
# Encerrando os processos abertos da base de dados "banco_geral"

!fuser banco_geral
!fuser -k banco_geral

In [ ]:
import sqlite3
import pandas as pd

# Criação da tabela Compras

compras = sqlite3.connect('banco_geral')

cursor = compras.cursor()

cursor.execute('CREATE TABLE compras (id INTEGER PRIMARY KEY, cliente_id INT, produto TEXT, valor REAL, FOREIGN KEY (cliente_id) REFERENCES reclientes(id))')

# salvando alterações

compras.commit()

Insira algumas compras associadas a clientes existentes na tabela "clientes".

In [ ]:
# inclusão de 10 registros de compras na tabela

cursor.execute('INSERT INTO compras(id, cliente_id, Produto, Valor) VALUES(1, 1, "Cerveja", 20.0)')
cursor.execute('INSERT INTO compras(id, cliente_id, Produto, Valor) VALUES(2, 2, "Pizza", 50.0)')
cursor.execute('INSERT INTO compras(id, cliente_id, Produto, Valor) VALUES(3, 3, "Hamburguer", 15.0)')
cursor.execute('INSERT INTO compras(id, cliente_id, Produto, Valor) VALUES(4, 4, "Sorvete", 10.0)')
cursor.execute('INSERT INTO compras(id, cliente_id, Produto, Valor) VALUES(5, 5, "Biscoito", 5.0)')
cursor.execute('INSERT INTO compras(id, cliente_id, Produto, Valor) VALUES(6, 6, "Macarrão", 8.0)')
cursor.execute('INSERT INTO compras(id, cliente_id, Produto, Valor) VALUES(7, 7, "Chocolate", 12.0)')
cursor.execute('INSERT INTO compras(id, cliente_id, Produto, Valor) VALUES(8, 8, "Suco", 3.0)')
cursor.execute('INSERT INTO compras(id, cliente_id, Produto, Valor) VALUES(9, 9, "Batata", 7.0)')
cursor.execute('INSERT INTO compras(id, cliente_id, Produto, Valor) VALUES(10, 10, "Salada", 10.0)')

# salvando alterações

compras.commit()

In [ ]:
# PRINTANDO A TABELA

# consulta SQL
query = "SELECT * FROM compras"

# carregar os resultados no pandas
df = pd.read_sql_query(query, compras)

# exibir a tabela no Colab
df

# printando os resultados
print(df)

   id  cliente_id     produto  valor
0   1           1     Cerveja   20.0
1   2           2       Pizza   50.0
2   3           3  Hamburguer   15.0
3   4           4     Sorvete   10.0
4   5           5    Biscoito    5.0
5   6           6    Macarrão    8.0
6   7           7   Chocolate   12.0
7   8           8        Suco    3.0
8   9           9      Batata    7.0
9  10          10      Salada   10.0

In [ ]:
conexao = sqlite3.connect('banco_geral')
query = "SELECT name FROM sqlite_master WHERE type='table';"
df = pd.read_sql_query(query, conexao)

print(df)

       name
0  clientes
1   compras

Escreva uma consulta para exibir o nome do cliente, o produto e o
valor de cada compra.

In [ ]:
# Conectando ao banco de dados
conexao = sqlite3.connect('banco_geral')

# Realizando o JOIN entre as tabelas 'reclientes' e 'compras'
query = '''
    SELECT clientes.Nome, compras.produto, compras.valor
    FROM clientes
    INNER JOIN compras ON clientes.id = compras.cliente_id
'''

# Carregar os resultados no pandas
df = pd.read_sql_query(query, conexao)

# Exibir os resultados
print(df)

# Fechar a conexão
conexao.close()

      Nome     produto  valor
0   Bianca     Cerveja   20.0
1      Ana       Pizza   50.0
2   Esther  Hamburguer   15.0
3  Larissa     Sorvete   10.0
4    Clara    Biscoito    5.0
5    Bruna    Macarrão    8.0
6    Luana   Chocolate   12.0
7     Zara        Suco    3.0
8  Seleste      Batata    7.0
9     Mara      Salada   10.0